{
  "wudhu": {
    "hadith1": {
      "title": "وضوء | The Beautiful Way of Wudhu",
      "summary": "Demonstration of proper wudhu technique starting with intention and praise of water's purity",
      "steps": [
        {
          "arabic": "بَيْنَا أَمِيرُ الْمُؤْمِنِينَ (عَلَيْهِ السَّلاَمُ) ذَاتَ يَوْمٍ جَالِساً مَعَ ابْنِ الْحَنَفِيَّةِ إِذْ قَالَ: يَا مُحَمَّدُ ائتِنِي بِإِنَاءٍ فِيهِ مَاءٌ أَتَوَضَّأْ لِلصَّلَاةِ",
          "transliteration": "Baynā Amīr al-Mu'minīn ('alayhi s-salāmu) dhāta yawmin jālisan ma'a ibn al-Ḥanafiyyah idh qāl: Yā Muḥammad i'tinī bi-inā'in fīhi mā'un atawaḍḍa'u li ṣ-ṣalāh",
          "translation": "While the Commander of the Faithful (peace be upon him) was sitting one day with Ibn al-Hanafiyyah, he said: 'O Muhammad, bring me a vessel with water so I may perform ablution for prayer.'"
        },
        {
          "arabic": "فَأتَاهُ مُحَمَّدٌ بِالْمَاءِ فَأَكْفَأَ بِيَدِهِ الْيُمْنَى عَلَى يَدِهِ الْيُسْرَى ثُمَّ قَالَ: بِسْمِ الله الْحَمْدُ للهِ الَّذِي جَعَلَ الْمَاءَ طَهُوراً وَلَمْ يَجْعَلْهُ نَجِساً",
          "transliteration": "Fa-atāhu Muḥammadun bil-mā'i fa-akfa'a biyadihi l-yumnā 'alā yadihi l-yusrā thumma qāl: Bismillāh, al-ḥamdu lillāhi l-ladhī ja'ala l-mā'a ṭahūran wa-lam yaj'alhu najisan",
          "translation": "Muhammad brought him the water, and he poured his right hand over his left hand, then said: 'In the name of Allah. Praise be to Allah, Who made water purifying and not impure.'"
        },
        {
          "arabic": "ثُمَّ تَمَضْمَضَ ثَلَاثاً وَاسْتَنْشَقَ ثَلَاثاً، وَقَالَ: اللَّهُمَّ لَقِّنِي حُجَّتِي يَوْمَ أَلْقَاكَ وَأَطْلِقْ لِسَانِي بِذِكْرِكَ",
          "transliteration": "Thumma tamaḍmaḍa thalāthan wa-stanshaqaa thalāthan, wa-qāl: Allāhumma laqinnī ḥujjatī yawma alqāka wa-aṭliq lisānī bi-dhikrika",
          "translation": "Then he rinsed his mouth three times and inhaled water into his nose three times, saying: 'O Allah, teach me my evidence on the day I meet You, and loosen my tongue with Your remembrance.'"
        },
        {
          "arabic": "ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثاً، وَقَالَ: اللَّهُمَّ بَيِّضْ وَجْهِي يَوْمَ تَسْوَدُّ فِيهِ الْوُجُوهُ، وَلَا تُسَوِّدْ وَجْهِي يَوْمَ تَبْيَضُّ فِيهِ الْوُجُوهُ",
          "transliteration": "Thumma ghasala wajhahu thalāthan, wa-qāl: Allāhumma bayyiḍ wajhī yawma taswaddu fīhi l-wujūh, wa-lā tusawwid wajhī yawma tabyaḍḍu fīhi l-wujūh",
          "translation": "Then he washed his face three times, saying: 'O Allah, whiten my face on the day when faces will be blackened, and do not blacken my face on the day when faces will be whitened.'"
        },
        {
          "arabic": "ثُمَّ غَسَلَ يَدَهُ الْيُمْنَى ثَلَاثاً، وَقَالَ: اللَّهُمَّ أَعْطِنِي كِتَابِي بِيَمِينِي وَالْخُلْدَ فِي الْجِنَانِ بِيَسَارِي، وَحَاسِبْنِي حِسَاباً يَسِيراً",
          "transliteration": "Thumma ghasala yadahu l-yumnā thalāthan, wa-qāl: Allāhumma a'ṭinī kitābī bi-yamīnī wa-l-khulda fī l-jināni bi-yasārī, wa-ḥāsibnī ḥisāban yasīrā",
          "translation": "Then he washed his right arm three times, saying: 'O Allah, give me my book in my right hand and eternity in Paradise in my left hand, and reckon with me an easy reckoning.'"
        },
        {
          "arabic": "ثُمَّ غَسَلَ يَدَهُ الْيُسْرَى ثَلَاثاً، وَقَالَ: اللَّهُمَّ لَا تُعْطِنِي كِتَابِي بِشِمَالِي وَلَا مِنْ وَرَاءِ ظَهْرِي، وَلَا تَجْعَلْهَا مَغْلُولَةً إِلَى عُنُقِي، وَأَعُوذُ بِكَ مِنْ مُقَطَّعَاتِ النِّيرَانِ",
          "transliteration": "Thumma ghasala yadahu l-yusrā thalāthan, wa-qāl: Allāhumma lā tu'ṭinī kitābī bi-shimālī wa-lā min warā'i ẓahrī, wa-lā taj'alhā maghlūlatan ilā 'unuqī, wa-a'ūdhu bika min muqaṭṭa'āti n-nīrān",
          "translation": "Then he washed his left arm three times, saying: 'O Allah, do not give me my book in my left hand, nor from behind my back, and do not make it chained to my neck. I seek refuge in You from the cutting portions of the Fire.'"
        },
        {
          "arabic": "ثُمَّ مَسَحَ رَأْسَهُ، وَقَالَ: اللَّهُمَّ غَشِّنِي بِرَحْمَتِكَ وَبَرَكَاتِكَ وَعَفْوِكَ",
          "transliteration": "Thumma masaḥa ra'sahu, wa-qāl: Allāhumma ghashshinī bi-raḥmatika wa-barakātika wa-'afwik",
          "translation": "Then he wiped his head, saying: 'O Allah, cover me with Your mercy, Your blessings, and Your forgiveness.'"
        }
      ]
    },
    "hadith2": {
      "title": "وضوء | Wudhu Wisdom from the Prophet",
      "summary": "Essential teachings on the spiritual significance of ablution rituals",
      "steps": [
        {
          "arabic": "قال رسول الله ﷺ: إِذَا تَوَضَّأَ الْعَبْدُ الْمُؤْمِنُ فَمَضْمَضَ خَرَجَتِ الْخَطَايَا مِنْ فِيهِ",
          "transliteration": "Qāla Rasūlu llāhi ﷺ: Idhā tawaḍḍa'a l-'abdu l-mu'minu fa-maḍmaḍa kharajati l-khaṭāyā min fīhi",
          "translation": "The Messenger of Allah ﷺ said: 'When the believing servant performs ablution and rinses his mouth, the sins depart from his mouth.'"
        },
        {
          "arabic": "فَإِذَا اسْتَنْثَرَ خَرَجَتِ الْخَطَايَا مِنْ أَنْفِهِ",
          "transliteration": "Fa-idhā stanthara kharajati l-khaṭāyā min anfihi",
          "translation": "When he clears his nose, the sins depart from his nose."
        },
        {
          "arabic": "فَإِذَا غَسَلَ وَجْهَهُ خَرَجَتِ الْخَطَايَا مِنْ وَجْهِهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَشْفَارِ عَيْنَيْهِ",
          "transliteration": "Fa-idhā ghasala wajhahu kharajati l-khaṭāyā min wajhihi ḥattā takhruja min taḥti ashfāri 'aynayhi",
          "translation": "When he washes his face, the sins depart from his face, even from beneath his eyelashes."
        },
        {
          "arabic": "فَإِذَا غَسَلَ يَدَيْهِ خَرَجَتِ الْخَطَايَا مِنْ يَدَيْهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِ يَدَيْهِ",
          "transliteration": "Fa-idhā ghasala yadayhi kharajati l-khaṭāyā min yadayhi ḥattā takhruja min taḥti aẓfāri yadayhi",
          "translation": "When he washes his hands, the sins depart from his hands, even from beneath his fingernails."
        },
        {
          "arabic": "فَإِذَا مَسَحَ بِرَأْسِهِ خَرَجَتِ الْخَطَايَا مِنْ رَأْسِهِ حَتَّى تَخْرُجَ مِنْ أُذُنَيْهِ",
          "transliteration": "Fa-idhā masaḥa bi-ra'sihi kharajati l-khaṭāyā min ra'sihi ḥattā takhruja min udhnayhi",
          "translation": "When he wipes his head, the sins depart from his head, even from his ears."
        }
      ]
    }
  },
  "sajjadiya": {
    "supplication1": {
      "title": "الدعاء بالتوبة | Supplication on Confession",
      "summary": "Heartfelt prayer acknowledging human imperfection and seeking divine mercy",
      "steps": [
        {
          "arabic": "وَكَانَ مِنْ دُعَائِهِ عَلَيْهِ السَّلَامُ",
          "transliteration": "Wa-kāna min du'ā'ihi 'alayhi s-salām",
          "translation": "And among his prayers (upon him be peace)"
        },
        {
          "arabic": "فِي الِاعْتِرَافِ وَطَلَبِ التَّوْبَةِ إِلَى اللَّهِ تَعَالَى",
          "transliteration": "Fī l-i'tirāfi wa-ṭalabi t-tawbati ilā llāhi ta'ālā",
          "translation": "in confession and seeking repentance from Allah, the Exalted:"
        },
        {
          "arabic": "اللَّهُمَّ إِنَّهُ يَحْجُبُنِي عَنْ مَسْأَلَتِكَ خِلَالٌ ثَلَاثٌ، وَتَحْدُونِي عَلَيْهَا خَلَّةٌ وَاحِدَةٌ",
          "transliteration": "Allāhumma innahu yaḥjubunī 'an mas'alatika khilālun thalāth, wa-taḥdūnī 'alayhā khallatun wāḥidah",
          "translation": "O Allah, three traits prevent me from asking You, yet one trait compels me:"
        },
        {
          "arabic": "يَحْجُبُنِي أَمْرٌ أَمَرْتَ بِهِ فَأَبْطَأْتُ عَنْهُ",
          "transliteration": "Yaḥjubunī amrun amarta bihi fa-abṭa'tu 'anhu",
          "translation": "What prevents me is a command You ordered, but I delayed in obeying;"
        },
        {
          "arabic": "وَنَهْيٌ نَهَيْتَنِي عَنْهُ فَأَسْرَعْتُ إِلَيْهِ",
          "transliteration": "Wa-nahyun nahaytanī 'anhu fa-asra'tu ilayhi",
          "translation": "a prohibition You forbade, but I hastened toward it;"
        },
        {
          "arabic": "وَنِعْمَةٌ أَنْعَمْتَ بِهَا عَلَيَّ فَقَصَّرْتُ فِي شُكْرِهَا",
          "transliteration": "Wa-ni'matun an'amta bihā 'alayya fa-qaṣṣartu fī shukrihā",
          "translation": "and a blessing You bestowed, but I fell short in gratitude."
        },
        {
          "arabic": "وَيَحْدُونِي عَلَى مَسْأَلَتِكَ تَفَضُّلُكَ عَلَى مَنْ أَقْبَلَ بِوَجْهِهِ إِلَيْكَ",
          "transliteration": "Wa-yaḥdūnī 'alā mas'alatika tafaḍḍuluka 'alā man aqbala bi-wajhihi ilayka",
          "translation": "What compels me is Your grace toward those who turn to You"
        },
        {
          "arabic": "وَوَفَدَ بِحُسْنِ ظَنِّهِ إِلَيْكَ",
          "transliteration": "Wa-wafada bi-ḥusni ẓannihi ilayka",
          "translation": "and approach You with good hope."
        },
        {
          "arabic": "إِذْ جَمِيعُ إِحْسَانِكَ تَفَضُّلٌ",
          "transliteration": "Idh jamī'u iḥsānika tafaḍḍul",
          "translation": "For all Your benevolence is grace,"
        },
        {
          "arabic": "وَإِذْ كُلُّ نِعَمِكَ ابْتِدَاءٌ",
          "transliteration": "Wa-idh kullu ni'amika ibtidā'",
          "translation": "and all Your favors are initiated by You alone."
        },
        {
          "arabic": "فَهَا أَنَا ذَا، يَا إِلَهِي وَاقِفٌ بِبَابِ عِزِّكَ وُقُوفَ المُسْتَسْلِمِ الذَّلِيلِ",
          "transliteration": "Fa-hā anā dhā, yā ilāhī wāqifun bi-bābi 'izzika wuqūfa l-mustaslimi dh-dhalīl",
          "translation": "Here I stand, my God, at the door of Your might--humbled and surrendered--"
        },
        {
          "arabic": "وَسَائِلُكَ عَلَى الحَيَاءِ مِنِّي سُؤَالَ البَائِسِ المُعِيلِ",
          "transliteration": "Wa-sā'iluka 'alā l-ḥayā'i minnī su'āla l-bā'isi l-mu'īl",
          "translation": "asking You despite my shame, like a destitute beggar."
        }
      ]
    }
  }
}